{"meta":{"title":"智能边缘计算实验室","subtitle":"","description":"","author":"刘通","url":"https://wulairen.github.io","root":"/"},"pages":[{"title":"分类","date":"2021-06-08T11:06:52.000Z","updated":"2021-06-09T00:42:49.950Z","comments":true,"path":"categories/index.html","permalink":"https://wulairen.github.io/categories/index.html","excerpt":"","text":""},{"title":"","date":"2020-05-05T13:39:53.000Z","updated":"2021-06-17T13:24:54.440Z","comments":true,"path":"index.html","permalink":"https://wulairen.github.io/index.html","excerpt":"","text":"自我介绍 刘通，副教授，硕士生导师，现就职于上海大学计算机工程与科学学院，毕业于上海交通大学计算机科学与工程系并获得博士学位。2017年8月起在上海大学计算机工程与科学学院工作。 2015- 2016年赴纽约州立大学石溪分校访问研究，2013-2014年在微软亚洲研究院工作。先后参与了上海市扬帆科技人才计划项目 、国家自然科学基金青年项目。 教育背景 2012/09– 2017/06上海交通大学（计算机科学与工程系） 博士研究生 2008/09 – 2012/07 上海交通大学（计算机科学与工程系）工学学士 联系方式 单位：上海大学计算机工程与科学学院 Email: tong_liu@shu.edu.cn 通信地址：上海市宝山区上大路99号 上海大学计算机学院1003 工作简历 2020/03 – 至今 上海大学(计算机工程与科学学院) 副教授 2017/08–2020/03 上海大学(计算机工程与科学学院) 讲师 2015/09 –2016/09 纽约州立大学石溪分校 访问学者，指导老师：Prof. Yuanyuan Yang，IEEE fellow 2013/11 – 2014/11 微软亚洲研究院 (Urban Computing Group) 实习生，指导老师：郑宇 博士 研究方向 边缘计算，城市计算，博弈论与强化学习等； 正在执行项目 1、上海市教育委员会，晨光计划，20CG47，基于异构边缘计算系统实现联邦学习的关键技术研究，2021-01至2023-12，6万，在研，主持 2、国家自然科学基金委员会，青年项目，61802245，基于张量分解的群智感知网络监测服务质量动态保障关键技术研究，2019-01至2021-12，25万元，在研，主持 3、上海市科学技术委员会，青年科技英才扬帆计划，18YF1408200，基于群智感知系统的高质量低开销数据收集方法研究，2018-05至2021-04，20万元，在研，主持 组内同学 2021：陈捷，姚文莹 2020：倪胜刚，任磊，郭东瑜，周煜彬 2019：李丹 毕业同学 2019：揭潇淦，杨家豪，吴鹤祥 2018：张亚萌，方璐 2017：武文斌"},{"title":"","date":"2021-06-17T14:03:02.000Z","updated":"2021-06-17T14:16:17.051Z","comments":true,"path":"home/index.html","permalink":"https://wulairen.github.io/home/index.html","excerpt":"","text":"CCF青年精英大会（沈阳） 毕业同学们谢师宴 欢迎20级新同学加入实验室 2020年happy新年"},{"title":"","date":"2021-06-08T02:10:01.000Z","updated":"2021-06-17T02:23:41.920Z","comments":true,"path":"研究方向介绍/index.html","permalink":"https://wulairen.github.io/%E7%A0%94%E7%A9%B6%E6%96%B9%E5%90%91%E4%BB%8B%E7%BB%8D/index.html","excerpt":"","text":"边缘计算 ​ 边缘计算，是指在靠近物或数据源头的一侧，采用网络、计算、存储、应用核心能力为一体的开放平台，就近提供最近端服务。其应用程序在边缘侧发起，产生更快的网络服务响应，满足行业在实时业务、应用智能、安全与隐私保护等方面的基本需求。边缘计算处于物理实体和工业连接之间，或处于物理实体的顶端。而云端计算，仍然可以访问边缘计算的历史数据。 ​ 边缘计算并非是一个新鲜词。作为一家内容分发网络CDN和云服务的提供商AKAMAI，早在2003年就与IBM合作“边缘计算”。作为世界上最大的分布式计算服务商之一，当时它承担了全球15-30%的网络流量。在其一份内部研究项目中即提出“边缘计算”的目的和解决问题，并通过AKAMAI与IBM在其WebSphere上提供基于边缘Edge的服务。 ​ 对物联网而言，边缘计算技术取得突破，意味着许多控制将通过本地设备实现而无需交由云端，处理过程将在本地边缘计算层完成。这无疑将大大提升处理效率，减轻云端的负荷。由于更加靠近用户，还可为用户提供更快的响应，将需求在边缘端解决。 强化学习 ​ 强化学习是智能体（Agent）以“试错”的方式进行学习，通过与环境进行交互获得的奖赏指导行为，目标是使智能体获得最大的奖赏，强化学习不同于连接主义学习中的监督学习，主要表现在强化信号上，强化学习中由环境提供的强化信号是对产生动作的好坏作一种评价(通常为标量信号)，而不是告诉强化学习系统RLS(reinforcement learning system)如何去产生正确的动作。由于外部环境提供的信息很少，RLS必须靠自身的经历进行学习。通过这种方式，RLS在行动-评价的环境中获得知识，改进行动方案以适应环境。 城市计算 城市计算是一个交叉学科，是计算机科学以城市为背景，跟城市规划、交通、能源、环境、社会学和经济等学科融合的新兴领域。更具体的说，城市计算是一个通过不断获取、整合和分析城市中多种异构大数据来解决城市所面临的挑战（如环境恶化、交通拥堵、能耗增加、规划落后等）的过程。城市计算将无处不在的感知技术、高效的数据管理和分析算法，以及新颖的可视化技术相结合，致力于提高人们的生活品质、保护环境和促进城市运转效率。城市计算帮助我们理解各种城市现象的本质，甚至预测城市的未来。 城市计算的基本框架，包括城市感知及数据捕获、数据管理、城市数据分析、服务提供四个环节。与自然语言分析和图像处理等“单数据单任务” 系统相比，城市计算是一个“多数据多任务”的系统。城市计算中的任务涵盖改进城市规划、缓解交通拥堵、保护自然环境、减少能源消耗等等。而在一个任务中又需要同时用到多种数据。比如，在城市规划的设计过程中，我们需要同时参考道路结构、兴趣点分布、交通流等多种数据源。"},{"title":"","date":"2021-06-08T13:00:14.000Z","updated":"2021-06-17T07:15:44.336Z","comments":true,"path":"实验室学生/index.html","permalink":"https://wulairen.github.io/%E5%AE%9E%E9%AA%8C%E5%AE%A4%E5%AD%A6%E7%94%9F/index.html","excerpt":"","text":""},{"title":"","date":"2021-06-08T02:10:01.000Z","updated":"2021-06-17T07:28:54.644Z","comments":true,"path":"自我介绍/index.html","permalink":"https://wulairen.github.io/%E8%87%AA%E6%88%91%E4%BB%8B%E7%BB%8D/index.html","excerpt":"","text":"自我介绍 刘通，副教授，硕士生导师，现就职于上海大学计算机工程与科学学院，毕业于上海交通大学计算机科学与工程系并获得博士学位。2017年8月起在上海大学计算机工程与科学学院工作。 2015- 2016年赴纽约州立大学石溪分校访问研究，2013-2014年在微软亚洲研究院工作。先后参与了上海市扬帆科技人才计划项目 、国家自然科学基金青年项目。 教育背景 2012/09– 2017/06上海交通大学（计算机科学与工程系） 博士研究生 2008/09 – 2012/07 上海交通大学（计算机科学与工程系）工学学士 联系方式 单位：上海大学计算机工程与科学学院 Email: tong_liu@shu.edu.cn 通信地址：上海市宝山区上大路99号 上海大学计算机学院1003 工作简历 2020/03 – 至今 上海大学(计算机工程与科学学院) 副教授 2017/08–2020/03 上海大学(计算机工程与科学学院) 讲师 2015/09 –2016/09 纽约州立大学石溪分校 访问学者，指导老师：Prof. Yuanyuan Yang，IEEE fellow 2013/11 – 2014/11 微软亚洲研究院 (Urban Computing Group) 实习生，指导老师：郑宇 博士 研究方向 边缘计算，城市计算，博弈论与强化学习等； 正在执行项目 1、上海市教育委员会，晨光计划，20CG47，基于异构边缘计算系统实现联邦学习的关键技术研究，2021-01至2023-12，6万，在研，主持 2、国家自然科学基金委员会，青年项目，61802245，基于张量分解的群智感知网络监测服务质量动态保障关键技术研究，2019-01至2021-12，25万元，在研，主持 3、上海市科学技术委员会，青年科技英才扬帆计划，18YF1408200，基于群智感知系统的高质量低开销数据收集方法研究，2018-05至2021-04，20万元，在研，主持 组内同学 2021：陈捷，姚文莹 2020：倪胜刚，任磊，郭东瑜，周煜彬 2019：李丹 毕业同学 2019：揭潇淦，杨家豪，吴鹤祥 2018：张亚萌，方璐 2017：武文斌"},{"title":"","date":"2021-06-08T12:33:24.000Z","updated":"2021-06-17T05:42:24.085Z","comments":true,"path":"论文列表/index.html","permalink":"https://wulairen.github.io/%E8%AE%BA%E6%96%87%E5%88%97%E8%A1%A8/index.html","excerpt":"","text":"期刊论文 1. Tong Liu*, Yameng Zhang, Yanmin Zhu, Weiqin Tong, Yuanyuan Yang, Online Computation Offloading and Resource Scheduling in Mobile Edge Computing, IEEEInternet of Things Journal, 2021,已在线发表. 2. Tong Liu*, Lu Fang, Yanmin Zhu, Weiqin Tong, Yuanyuan Yang, A Near-Optimal Approach for Online Task Offloading and Resource Allocation in Edge-Cloud Orchestrated Computing,IEEE Transactions on Mobile Computing, 2021, 已在线发表. 3. Tong Liu*, Wenbin Wu, Yanmin Zhu, Weiqin Tong, Predicting taxi demands via an attention-based convolutional recurrent neural network, Knowl. Based Syst., 2020, 206: 106294. 4. Tong Liu*, Yameng Zhang, Xiaoxian Yang, Weiqin Tong, Near-Optimal User Recruitment in Mobile Crowdsensing for Urban Fine-Grained Event Detection, IEEE Access, 2020, 8: 514-525. 5. Tong Liu, Yanmin Zhu*, Yuanyuan Yang, and Fan Ye, ALC2: When Active Learning meets Compressive Crowdsensing for Urban Air Pollution Monitoring, *IEEE Internet of Things Journal*, 2019, 6(6): 9427-9438. (中科院1区，JCR 1区，IF=9.936) 6. Tong Liu, Yanmin Zhu*, Liqun Huang, TGBA: A two-phase group buying based auction mechanism for recruiting workers in mobile crowd sensing, Computer Networks, 2019, 149: 56-75. (CCF B类， JCR 3区，IF=2.522) 7. Tong Liu, Yanmin Zhu*, Ting Wen, and Jiadi Yu, Location Privacy-Preserving Method for Auction-Based Incentive Mechanisms in Mobile Crowd Sensing, The Computer Journa, 2018, 61(6): 937-948. (CCF B类，JCR 4区，IF= 0.792) 8. Tong Liu, Yanmin Zhu*, Ruobing Jiang, and Qingwen Zhao, Distributed Social Welfare Maximization in Urban Vehicular Participatory Sensing Systems, IEEE Transactions on Mobile Computing, 2018, 17(6): 1314-1325. (CCF A类，JCR 2区，IF=4.098) 9. Tong Liu, Yanmin Zhu*, Hongzi Zhu, Jiadi Yu, Yuanyuan Yang, and Fan Ye, Online Pricing for Efficient Renewable Energy Sharing in a Sustainable Microgrid, The Computer Journal, 2017, 60(2): 268-284. (CCF B类，JCR 4区，IF=0.792) 10. Tong Liu, Tao Gu*, Ning Jin, and Yanmin Zhu, A Mixed Transmission Strategy to Achieve Energy Balancing in Wireless Sensor Networks, IEEE Transactions on Wireless Communications, 2017, 16(4): 2111-2122. (CCF B类，JCR 2区，IF= 5.888) 11. Tong Liu, Yanmin Zhu*, Qian Zhang, and Athanasios Vasilakos, Stochastic Optimal Control for Participatory Sensing Systems with Heterogeneous Requests, IEEE Transactions on Computers, 2016, 65(5): 1619-1631. (CCF A 类，JCR 2区，IF=3.052) 12. Tong Liu, Yanmin Zhu*, Ruobing Jiang, and Bo Li, A Sociality-aware Approach to Computing Backbone in Mobile Opportunistic Networks, Ad Hoc Networks,* 2015, 24: 46-56. (CCF C 类，JCR 3区，IF= 3.151) 13. Tong Liu, Yanmin Zhu*, Social Welfare Maximization in Participatory Smartphone Sensing”, Computer Networks,2014, 73: 195-209. (CCF B类， JCR 3区，IF=2.522) 14. Ruobing Jiang, Yanmin Zhu*, Tong Liu, and Qiuxia Chen, “Compressive Detection and Localization of Multiple Heterogeneous Events in Sensor Networks”, Ad Hoc Networks, 65(2017):65-77, 2017. (CCF C 类，JCR 3区，IF= 3.151) 15. Yanmin Zhu*, Wei Sun, Jiadi Yu, Tong Liu, and Bo Li, “Distributed Spectrum Sharing in Cognitive Radio Networks: A Pricing-based Decomposition Approach”, International Journal of Distributed Sensor Networks, 2014. (SCI) 会议论文 1. Yameng Zhang, Tong Liu*, Yanmin Zhu, Yuanyuan Yang, A Deep Reinforcement Learning Approach for Online Computation Offloading in Mobile Edge Computing, IEEE/ACM 28th International Symposium on Quality of Service (IWQoS 2020), Hangzhou, China, 2020, pp. 1-10. 2. Lu Fang, Tong Liu*, Yanmin Zhu, Yuanyuan Yang, Task Offloading and Dispatching for MEC with Selfish Mobile Devices and Access Points, IEEE Global Communications Conference (GLOBECOM 2020), Taipei, Taiwan, 2020, pp. 1-6. 3. Xiaogan Jie, Tong Liu*, Honghao Gao, Chenhong Cao, Peng Wang, Weiqin Tong, A DQN-based Approach for Online Service Placement in Mobile Edge Computing, International Conference on Collaborative Computing: Networking, Applications and Worksharing (CollaborateCom 2020), Springer, Cham, 2020: 169-183. 4. Lu Fang, Tong Liu*, Honghao Gao, Chenhong Cao, Weimin Li, Weiqin Tong, An Efficient and Truthful Online Incentive Mechanism for a Social Crowdsensing Network, International Conference on Collaborative Computing: Networking, Applications and Worksharing (CollaborateCom 2020), Springer, Cham, 2020: 49-63. 5. Wenbin Wu, Tong Liu*, Jiahao Yang, CACRNN: A Context-Aware Attention-Based Convolutional Recurrent Neural Network for Fine-Grained Taxi Demand Prediction, Pacific-Asia Conference on Knowledge Discovery and Data Mining (PAKDD 2020), 2020, pp. 636-648. 6. TianXiang Qin, Tong Liu*, Hexiang Wu, Weiqin Tong and Shimin Zhao, RESGCN: RESidual Graph Convolutional Network based Free Dock Prediction in Bike Sharing System, 21st IEEE International Conference on Mobile Data Management (MDM 2020), Versailles, France, 2020, pp. 210-217. 7. Lubin Liu, Tong Liu*, Xinglang Wang, Tao Xiao, Wei Fang, Hongyue Chen, NuMessage: Providing Scalable and Reliable Messaging Service in Distributed Systems, International Conference on Web Engineering (ICWE 2020), pp. 102-110. 8. Tong Liu*, Suqin Sheng, Lu Fang, Yameng Zhang, Tao Zhang, Weiqin Tong, Latency-Minimized and Energy-Efficient Online Task Offloading for Mobile Edge Computing with Stochastic Heterogeneous Tasks, IEEE 25th International Conference on Parallel and Distributed Systems (ICPADS 2019), pp. 376-383. (CCF C 类) 9. Tong Liu*, Wenbin Wu, Yanmin Zhu, and Weiqin Tong, Accuracy-Guaranteed Event Detection via Collaborative Mobile Crowdsensing with Unreliable Users, International Conference on Collaborative Computing: Networking, Applications and Worksharing (Collaboratecom 2019), pp. 729-744. (CCF C 类) 10. Tong Liu, Yanmin Zhu*, Yuanyuan Yang and Fan Ye, Incentive Design for Air Pollution Monitoring based on Compressive Crowdsensing, Proc. 2016 IEEE Global Communications Conference (GLOBECOM2016), 2016, pp. 1-6. (CCF C 类) 11. Tong Liu, Yanmin Zhu*, Hongzi Zhu, Jiadi Yu, Yuanyuan Yang and Fan Ye, Long-Term Renewable Energy Usage Maximization in a Microgrid, Proc. 25th International Conference on Computer Communication and Neetworks (ICCCN2016), 2016, pp. 1-8. (CCF C 类) 12. Tong Liu, Yanmin Zhu*, Social Welfare Maximization in Participatory Smartphone Sensing, Proc. 8th International Conference on Wireless Algorithms, Systems, and Applications (WASA 2013), 2013, pp. 351-365. (CCF C 类) 13. Tong Liu, Yanmin Zhu*, Ruobing Jiang and Bo Li, A Sociality-aware Approach to Computing Backbone in Mobile Opportunistic Networks, Proc. 2013 IEEE Global Communications Conference (GLOBECOM 2013), 2013, pp. 389-394. (CCF C 类) 14. Ting Wen, Yanmin Zhu* and Tong Liu, “P2: A Location Privacy-Preserving Auction Mechanism for Mobile Crowd Sensing”, Proc. 2016 IEEE Global Communications Conference (GLOBECOM2016), 2016. (CCF C 类) 15. Yu Zheng*, Tong Liu, Yilun Wang, Yanchi Liu, Yanmin Zhu and Eric Chang, “Diagnosing New York City’s Noises with Ubiquitous Data”, Proc. 16th ACM International Joint Conference on Pervasive and Ubiquitous Computing(UbiComp 2014), 2014. (CCF A 类) 16. Wei Sun, Jiadi Yu* and Tong Liu, “A Distributed Spectrum Sharing Algorithm in Cognitive Radio Networks”, Proc. 20th IEEE International Conference on Parallel and Distributed Systems (ICPADS2014), 2014. (CCF C 类) 专利 已授权专利 1. 刘通，朱燕民，“电能调控方法及调控系统”，申请号：2016103025796，授权公告号：CN105932665B。 2. 刘通，朱燕民，“一种群智感知系统的激励方法”，申请号：2016103015652，授权公告号：CN106021861B。 3. 韩阳，朱燕民，刘通，“参与式感知系统中平台利润最大化的在线控制方法”，专利号：2014100126194，授权公告号：CN103761666B。 4. 刘通，朱燕民，朱弘恣，“一种群智感知系统中任务接入和分配的在线控制方法”,专利号：2013104828079，授权公告号：CN103761666B。 5. 朱燕民，刘通，“一种无线传感网中干扰模型测量方法及装置”，专利号：2012102345587，授权公告号：CN103761666B。 申请中专利 1. 刘通; 揭潇淦; 童维勤; 李卫民，“一种边缘计算系统中的在线服务放置方法”，申请号：2020112225976 2. 刘通; 方璐; 童维勤; 李卫民，“一种多接入边缘计算系统中的任务卸载与分派方法”，申请号：2020112228103 3. 刘通; 张亚萌; 熊赟; 童维勤，“一种基于位置的群智感知应用的隐私保护方法”，申请号：2020109571634 4. 刘通; 方璐; 熊赟; 童维勤，“一种用于群智感知系统的在线激励机制方法”，申请号：202010957162X 5. 丁学海; 张庆杰; 童维勤; 沈文枫; 刘通，“一种多模态室内定位导航方法及系统”，申请号：2020104860816 6. 刘通; 张亚萌; 李成范; 童维勤，“一种基站密集型边缘计算网络中的在线任务卸载方法”，申请号：2020104456678 7. 刘通; 武文斌; 童维勤，“一种基于注意力机制的细粒度打车需求预测方法”，申请号：2020101150711，状态：公布。 8. 刘通; 秦天翔; 童维勤，“一种基于残差图卷积的共享单车空闲车桩预测方法”，申请号：2020101149983 9. 刘通; 方璐，“一种边缘计算系统中分布式的在线任务卸载调度方法”，申请号：2019110621190 10. 刘通; 武文斌; 朱燕民; 童维勤，“一种基于群智感知系统的事件检测方法”，申请号：2019104162262，状态：公布。"},{"title":"恭喜张亚萌论文被IWQos(CCF—B)接受","date":"2020-04-14T07:43:12.000Z","updated":"2021-06-17T07:48:37.509Z","comments":true,"path":"home/index/恭喜张亚萌论文被IWQos-CCF—B-接受.html","permalink":"https://wulairen.github.io/home/index/%E6%81%AD%E5%96%9C%E5%BC%A0%E4%BA%9A%E8%90%8C%E8%AE%BA%E6%96%87%E8%A2%ABIWQos-CCF%E2%80%94B-%E6%8E%A5%E5%8F%97.html","excerpt":"","text":"A Deep Reinforcement Learning Approach for Online Computation Offloading in Mobile Edge Computing Abstract: With the explosion of mobile smart devices, many computation intensive applications have emerged, such as interactive gaming and augmented reality. Mobile edge computing is put forward, as an extension of cloud computing, to meet the low-latency requirements of the applications. In this paper, we consider an edge computing system built in an ultra-dense network with numerous base stations, and heterogeneous computation tasks are successively generated on a smart device moving in the network. An optimal task offloading strategy, as well as optimal CPU frequency and transmit power scheduling, is desired by the device user, to minimize both task completion latency and energy consumption in a long-term. However, due to the stochastic computation tasks and dynamic network conditions, the problem is particularly difficult to solve. Inspired by reinforcement learning, we transform the problem into a Markov decision process. Then, we propose an online offloading approach based on a double deep Q network, in which a specific neural network model is also provided to estimate the cumulative reward achieved by each action. We also conduct extensive simulations to compare the performance of our proposed approach with baselines. Download conference paper PDF"},{"title":"恭喜方璐论文被Collaboratecom(CCF—C)接受","date":"2020-09-08T08:02:19.000Z","updated":"2021-06-17T08:05:57.762Z","comments":true,"path":"home/index/恭喜方璐论文被Collaboratecom-CCF—C-接受.html","permalink":"https://wulairen.github.io/home/index/%E6%81%AD%E5%96%9C%E6%96%B9%E7%92%90%E8%AE%BA%E6%96%87%E8%A2%ABCollaboratecom-CCF%E2%80%94C-%E6%8E%A5%E5%8F%97.html","excerpt":"","text":"Task Offloading and Dispatching for MEC with Selfish Mobile Devices and Access Points"},{"title":"恭喜揭潇淦论文被Collaboratecom(CCF—C)接受","date":"2020-09-08T08:02:05.000Z","updated":"2021-06-17T08:05:00.920Z","comments":true,"path":"home/index/恭喜揭潇淦论文被Collaboratecom-CCF—C-接受.html","permalink":"https://wulairen.github.io/home/index/%E6%81%AD%E5%96%9C%E6%8F%AD%E6%BD%87%E6%B7%A6%E8%AE%BA%E6%96%87%E8%A2%ABCollaboratecom-CCF%E2%80%94C-%E6%8E%A5%E5%8F%97.html","excerpt":"","text":"A DQN-based Approach for Online Service Placement in Mobile Edge Computing"},{"title":"恭喜方璐论文被Globecom(CCF—C)接受","date":"2020-08-17T07:52:58.000Z","updated":"2021-06-17T07:55:31.833Z","comments":true,"path":"home/index/恭喜方璐论文被Globecom-CCF—C-接受.html","permalink":"https://wulairen.github.io/home/index/%E6%81%AD%E5%96%9C%E6%96%B9%E7%92%90%E8%AE%BA%E6%96%87%E8%A2%ABGlobecom-CCF%E2%80%94C-%E6%8E%A5%E5%8F%97.html","excerpt":"","text":"Task Offloading and Dispatching for MEC with Selfish Mobile Devices and Access Points Abstract: Multi-access Edge Computing (MEC) comes forth as a promising computing paradigm to meet the low-delay requirements of computation-intensive applications. In this work, we focus on the task offloading and dispatching problem in MEC, where mobile devices (MDs) can decide to execute tasks locally or offload them to access points (APs), and each AP can dispatch its received tasks to other APs. Specially, we consider both APs and MDs are selfish, which aim to minimize their respective task completion delay. The problem is particularly difficult, as there exists computing resource competition among MDs and APs, respectively. Furthermore, the offloading decisions made by MDs and the dispatching decisions made by APs are interactive. To overcome the challenges, we first formulate the problem as a multi-leader multi-follower Stackelberg game, and rigorously prove the existence of a Stackelberg equilibrium. Then, we propose an efficient approach to achieve a Stackelberg equilibrium, which includes a Q-learning based offloading strategy for MDs and a best response based dispatching strategy for APs. We also demonstrate an upper bound of the total completion delay achieved by our approach with a constant approximation ratio. Extensive simulations are also conducted to show the performance of our approach, compared with baselines. Download conference paper PDF"},{"title":"恭喜武文斌论文被PAKDD(CCF—C)接受","date":"2020-01-28T07:34:18.000Z","updated":"2021-06-17T07:48:35.757Z","comments":true,"path":"home/index/恭喜武文斌论文被PAKDD（CCF—C）接受.html","permalink":"https://wulairen.github.io/home/index/%E6%81%AD%E5%96%9C%E6%AD%A6%E6%96%87%E6%96%8C%E8%AE%BA%E6%96%87%E8%A2%ABPAKDD%EF%BC%88CCF%E2%80%94C%EF%BC%89%E6%8E%A5%E5%8F%97.html","excerpt":"","text":"CACRNN: A Context-Aware Attention-Based Convolutional Recurrent Neural Network for Fine-Grained Taxi Demand Prediction Abstract As taxis are primary public transport in metropolises, accurately predicting fine-grained taxi demands of passengers in real time is important for guiding drivers to plan their routes and reducing the waiting time of passengers. Many efforts have been paid to provide accurate taxi demand prediction, and deep neural networks are leveraged recently. However, existing works are limited in properly incorporating multi-view taxi demand predictions together, by simply assigning fixed weights learned by training to the predictions of each region. To solve this problem, we apply the attention mechanism for leveraging contextual information to assist prediction, and a context-aware attention-based convolutional recurrent neural network (CACRNN) is proposed. Specially, we forecast fine-grained taxi demands with considering multi-view features, including spatial correlations among adjacent regions, short-term periodicity, long-term periodicity, and impacts of external factors. Local convolutional (LC) layers and gated recurrent units (GRUs) are utilized to extract the features from historical records. Moreover, a context-aware attention module is employed to incorporate the predictions of each region with considering different features, which is our novel attempt. This module assigns different weights to the predictions of a region according to its contextual information such as weather, index of time slots, and region function. We conduct comprehensive experiments based on a large-scale real-world dataset from New York City, and the results show that our method outperforms state-of-the-art baselines. Keywords Taxi demand prediction Convolutional recurrent neural networks Attention mechanism Multi-view spatial-temporal feature extraction Download conference paper PDF"}],"posts":[{"title":"欢迎新同学","slug":"欢迎新同学","date":"2021-06-17T14:13:24.000Z","updated":"2021-06-17T14:13:24.691Z","comments":true,"path":"2021/06/17/欢迎新同学/","link":"","permalink":"https://wulairen.github.io/2021/06/17/%E6%AC%A2%E8%BF%8E%E6%96%B0%E5%90%8C%E5%AD%A6/","excerpt":"","text":"","categories":[],"tags":[]}],"categories":[],"tags":[]}